---
type: DocumentCreatingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DocumentCreatingEventArgs

`Autodesk.Revit.DB.Events.DocumentCreatingEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DocumentType | 2010 | `public DocumentType DocumentType { get ; }` |
| Property | Template | 2010 | `public string Template { get ; }` |